Revit 2024 API
StructuralElementDefinitionData Members
The StructuralElementDefinitionData type exposes the following members.
Constructors
Name | Description
StructuralElementDefinitionData
 Creates empty StructuralElementDefinitionData object.
Methods
Name | Description
Dispose
Releases all resources used by the StructuralElementDefinitionData
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CenterCurve
 The curve lying in the geometrical center of the element.
Curve
 The definition curve of the element.
EndShortening
 Cutback or extension at element curve end.
IsMirrored
 States if the structural section of the element is mirrored.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Normal
 The local Z direction of the element section in the start point of the curve.
Section
 Structural section of the element.
StartShortening
 Cutback or extension at element curve start.
YJust
 Y justification (ref axis).
YOffset
 Y offset.
ZJust
 Z justification (ref axis).
ZOffset
 Z offset.
See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace